package translator

// Keywords представляет список ключевых слов C# (категория W)
var Keywords = []string{
	"using",
	"namespace",
	"class",
	"static",
	"void",
	"int",
	"string",
	"float",
	"double",
	"bool",
	"if",
	"else",
	"for",
	"while",
	"return",
	"new",
	"true",
	"false",
}

// Operations представляет список операций и разделителей C# (категория O)
var Operations = []string{
	// Арифметические операции
	"+", "-", "*", "/", "%",
	// Операции сравнения
	"==", "!=", "<", ">", "<=", ">=",
	// Логические операции
	"&&", "||", "!",
	// Операции присваивания
	"=", "+=", "-=", "*=", "/=", "%=",
	// Разделители
	";", ",", ".", "(", ")", "{", "}", "[", "]",
}

// CommentMarkers представляет маркеры комментариев C#
var CommentMarkers = []string{
	// Строчные комментарии
	"//",
	// Блочные комментарии
	"/*", "*/",
}
